Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_FoundationLibraryRef/FoundationLibraryReference-level2.tmx
Source language: en_us
Languages: ja

source: Based on the values of the date Style and time Style properties, Date Formatter provides a representation of a specified date that is appropriate for a given locale.
ja: date Styleとtime Styleプロパティの値に基づいて、Date Formatterは指定された日付の、与えられたロケールにふさわしい表現を提供します。

source: Basic Collections
ja: 基本コレクション

source: Be sure to invoke this method with notification Name: nil notification Sender: nil (or remove Observer(_:)) before deallocating the observer object.
ja: notification Name: nil notification Sender: nilとともにこのメソッド（またはremove Observer(_:)）を、オブザーバオブジェクトをデアロケートする前に呼び出すことを確実にしてください。

source: Because nil is a valid return value, failure is signaled by invoking the object specifier’s set Evaluation Error: method before returning.
ja: nilは有効な戻り値なので、失敗は、返る前にオブジェクト指定子の持つset Evaluation Error:メソッドを発動することによって合図されます。

source: Because NSArray and CFArray are “toll-free bridged,” you can substitute a CFArray object for a NSArray object in your code (with appropriate casting).
ja: NSArrayとCFArrayは、「toll-freeブリッジ」されるので、あなたは、あなたのコードにおいて（適切なキャストを行うことで）CFArrayオブジェクトをNSArrayオブジェクトの代わりにすることができます。

source: Because Cocoa scripting invokes set Value(_: for Key:) and mutable Array Value(for Key:), changes to model objects made by AppleScript scripts are observable using automatic key-value observing.
ja: Cocoaスクリプティングはset Value(_: for Key:)とmutable Array Value(for Key:)を呼び出すことから、AppleScriptスクリプトによって作成されるモデルオブジェクトに対する変更は、自動キー値監視を使って監視できます。

source: Because children of directory file wrappers are not read immediately by the init(url: options:) method unless the NSFile Wrapper Reading Immediate reading option is used, even a newly-created directory file wrapper might not have the same contents as the directory on disk.
ja: ディレクトリファイルラッパーの子らは直ぐにinit(url: options:)メソッドによって読み出されることはNSFile Wrapper Reading Immediate読み出しオプションが使われない限りはないことから、新しく作成されたディレクトリファイルラッパーでさえディスク上のディレクトリと同じ内容を持たないかもしれません。

source: Because global resources take precedence over language-specific resources, you should never include both a global and localized version of a given resource in your app.
ja: グローバルリソースは言語特有のリソースを越える優先順をとることから、あなたは与えられたリソースのグローバルおよびローカライズ版の両方とも、あなたのアプリに決して含むべきではありません。

source: Because it actually replaces the descriptor, if any, at the specified position, this method might better be called replace Descriptor: at Index:.
ja: それが実際に記述子を、もしあれば、指定された位置で置き換えることから、このメソッドはreplace Descriptor: at Index:と呼びれるのがより適切かもしれません。

source: Because the NSImage object that's returned might be shared by many File Wrapper objects, you must not mutate it.
ja: 返されるNSImageオブジェクトが多くのFile Wrapperオブジェクトによって共有されるかもしれないことから、あなたはそれを変化させてはいけません。

source: Because the encoded form of the Coordinate type contains a second level of nested information, the type's adoption of the Encodable and Decodable protocols uses two enumerations that each list the complete set of coding keys used on a particular level.
ja: Coordinate型のエンコード形式は入れ子にされた情報の２番目の水準を含むことから、その型のもつEncodableとDecodableプロトコルの採用は２つの列挙を使います、それはそれぞれが特定の水準で使われるコーディングキーの完全な一揃いを列記します。

source: Because the enumeration is deep—that is, it lists the contents of all subdirectories—this enumerator object is useful for performing actions that involve large file-system subtrees.
ja: 列挙は深いことから — すなわち、それは下位ディレクトリの内容を一覧にします — この列挙子オブジェクトは巨大なファイルシステム下位ツリーを伴う動作を実行するのに有用です。

source: Because this method does not return error information, it has been deprecated as of OS X v10.5.
ja: このメソッドがエラー情報を返さないことから、それはOS X v10.5現在で非推奨にされます。

source: Because this method might take a nontrivial amount of time to set up iCloud and return the requested URL, you should always call it from a secondary thread.
ja: なぜならこのメソッドは、iCloudを準備して要請されたURLを返すのに些細ではない量の時間を取るからです、あなたは常にそれを二次的なスレッドから呼び出すべきです。

source: Because this method performs only shallow enumerations, options that prevent descending into subdirectories or packages are not allowed; the only supported option is skips Hidden Files.
ja: このメソッドは浅い列挙のみを実行することから、下位ディレクトリまたはパッケージを下っていくのを防止するオプションは利用可能ではありません；ただ１つのサポートされるオブションはskips Hidden Filesです。

source: Because this method recurses the directory’s contents, you might not want to use it in performance-critical code.
ja: このメソッドはディレクトリの内容を再帰することから、あなたは性能重視のコードにおいてそれを使おうと思わないかもしれません。

source: Because this option causes additional I/O, you shouldn't use it unnecessarily.
ja: このオプションが追加的なI／Oの原因となることから、あなたはそれを必要以上に使うべきではありません。

source: Before you can locate a resource, you must first specify which bundle contains it.
ja: あなたがあるリソースを捜し出す前に、あなたは最初にそれを含んでいるバンドルを指定しなければなりません。

source: Before you decide to create a custom formatter, make sure that you cannot configure the public subclasses to satisfy your requirements.
ja: あつらえのフォーマッタの作成をあなたが決定する前に、あなたがパブリックサブクラスを構成設定してあなたの要件を満たすことができないことに気をつけてください。

source: Beginning with OS X v10.6, the preferred method of referring to files is with a file:// URL. Instead of using this method, you can instantiate NSFile Wrapper with one of the initializers, set its preferred Filename property if necessary, and pass the result to add File Wrapper(_:).
ja: OS X v10.6からは、ファイル参照の優先メソッドは、file:// URLを使います。このメソッドを使うよりむしろ、あなたはNSFile Wrapperをイニシャライザの１つでインスタンス化して、それのpreferred Filenameプロパティを必要ならば設定して、そして結果をadd File Wrapper(_:)に渡すことができます。

source: Beginning with OS X v10.6, the preferred method of referring to files is with a file:// URL. Therefore, this method has been deprecated in favor of init(symbolic Link With Destination URL:).
ja: OS X v10.6からは、ファイル参照の優先メソッドは、file:// URLを使います。したがって、init(symbolic Link With Destination URL:)の方を支持して、このメソッドは非推奨となっています。

source: Beginning with OS X v10.6, the preferred method of referring to files is with a file:// URL. Therefore, this method has been deprecated in favor of init(url: options:).
ja: OS X v10.6からは、ファイル参照の優先メソッドは、file:// URLを使います。したがって、init(url: options:)の方を支持して、このメソッドは非推奨となっています。

source: Beginning with OS X v10.6, the preferred method of referring to files is with a file:// URL. Therefore, this method has been deprecated in favor of matches Contents(of:).
ja: OS X v10.6からは、ファイル参照の優先メソッドは、file:// URLを使います。したがって、matches Contents(of:)の方を支持して、このメソッドは非推奨となっています。

source: Beginning with OS X v10.6, the preferred method of referring to files is with a file:// URL. Therefore, this method has been deprecated in favor of read(from: options:).
ja: OS X v10.6からは、ファイル参照の優先メソッドは、file:// URLを使います。したがって、read(from: options:)の方を支持して、このメソッドは非推奨となっています。

source: Beginning with OS X v10.6, the preferred method of referring to files is with a file:// URL. Therefore, this method has been deprecated in favor of symbolic Link Destination URL.
ja: OS X v10.6からは、ファイル参照の優先メソッドは、file:// URLを使います。したがって、symbolic Link Destination URLの方を支持して、このメソッドは非推奨となっています。

source: Beginning with OS X v10.6, the preferred method of referring to files is with a file:// URL. Therefore, this method has been deprecated in favor of write(to: options: original Contents URL:).
ja: OS X v10.6からは、ファイル参照の優先メソッドは、file:// URLを使います。したがって、write(to: options: original Contents URL:)の方を支持して、このメソッドは非推奨となっています。

source: Block special file
ja: Block特殊ファイル

source: Blocks added to a block operation are dispatched with default priority to an appropriate work queue.
ja: あるブロック演算に加えられるブロックは、省略時の優先度で適切なワークキューに向けてディスパッチされます。

source: Both NSDecimal Add(_: _: _: _:) and NSDecimal Subtract(_: _: _: _:) call NSDecimal Normalize(_: _: _:).
ja: NSDecimal Add(_: _: _: _:)とNSDecimal Subtract(_: _: _: _:)は両方とも、NSDecimal Normalize(_: _: _:)を呼び出します。

source: Both parameters must be valid indices of the collection that are not equal to end Index.
ja: 両方のパラメータは、このコレクションの有効なインデックスで、end Indexと等しくない必要があります。

source: Boundaries occur at the transitions between word (\w) and non-word (\W) characters, with combining marks ignored.
ja: 境界は、連結記号を無視して、語（\w）と非語（\W）文字の間で移行部で生じます。

source: Built-in Decoding
ja: 組み込みデコーディング

source: Built-in Encoding
ja: 組み込みエンコーディング

source: Built-in types such as Array, Dictionary, and Optional also conform to Codable whenever they contain codable types.
ja: 組込みの型、例えばArray、Dictionary、そしてOptionalもまた、それらがコード化可能な型を含む時はいつでもCodableに準拠します。

source: Bundle objects always consider case when searching for resource files, even on file systems that support case-insensitive filenames.
ja: バンドルオブジェクトは、リソースファイルを検索する時に常に大文字小文字を考慮されます、ファイルシステムが大文字小文字を考慮しないファイル名をサポートするとしてもです。

source: Bundle objects follow a specific search pattern when looking for resources on disk.
ja: バンドルオブジェクトは、ディスク上でリソースを見つける時に特定のサーチパターンに従います。

source: Bundle structures vary depending on the target platform and the type of bundle you are building.
ja: バンドル構造は、あなたがビルドしている対象のプラットホームそしてバンドルの型次第でいろいろです。

source: Bundles have a folder as the root item.
ja: バンドルは、フォルダをルート項目として持ちます。

source: Bundles organize their contained resources into well-defined subdirectories, and bundle structures vary depending on the platform and the type of the bundle.
ja: これらバンドルはそれらの含むリソースをうまく定義されたいくつかの下位ディレクトリへと組織化します、そしてバンドル構造はプラットホームとバンドルの型によって異なります。

source: But there are situations where a custom NSArray object might come in handy.
ja: しかしあつらえのNSArrayオブジェクトが便利かもしれない場面があります。

source: By default these will only match at the start and end, respectively, of the input text.
ja: 初期値では、これらは、それぞれ、入力されたテキストの始まりと終わりにマッチするだけです。

source: By default, Calendars have no locale set.
ja: 初期状態で、Calendarはロケール一式を持ちません。

source: By default, it will not.
ja: 初期値では、それはそうしません。

source: By default, the Block iterator method calls the Block precisely once for each match, with a non-nil result and the appropriate flags.
ja: 初期状態では、「ブロック」イテレータ・メソッドは「ブロック」を、非nilのresultと適切なflagsとともに、各マッチに対して正確に一度だけ呼びます。

source: By default, the creation date, permissions, Finder label and color, and Spotlight comments of the original item are preserved on the new item.
ja: 初期状態で、元の項目の日付、権限、Finderのラベルとカラー、そしてSpotlightコメントは、新しい項目で保たれます。

source: By default, the enumeration starts with the first object and continues serially through the array to the last element specified by index Set.
ja: 初期状態では、列挙は最初のオブジェクトで開始して順次その配列をindex Setで指定される最後の要素まで続けます。

source: By default, the enumeration starts with the first object and continues serially through the array to the last object.
ja: 初期状態では、列挙は最初のオブジェクトで開始して順次その配列を最後のオブジェクトまで続けます。

source: By default, this property is nil.
ja: 初期状態で、このプロパティはnilです。

source: By default, this property is equal to December 31, 1949.
ja: 初期状態で、このプロパティは December 31, 1949 に等しいです。

source: By default, this property returns false.
ja: 初期状態では、このプロパティはfalseを返します。

source: By default, word boundaries are identified by means of a simple classification of characters as either “word” or “non-word”, which approximates traditional regular expression behavior.
ja: 初期値では、語境界は、“単語”または“非単語”どちらかとしての文字の単純な分類方法によって確認されます、それはおおよそ従来の正規表現挙動です。

source: By examining this dictionary clients can see the “raw” header information returned by the HTTP server.
ja: この辞書を検査することでクライアントはHTTPサーバーによって返される “生の” ヘッダ情報を見ることができます。

source: By making this adjustment, this function ensures consistent mouse-detection behavior from the user’s perspective.
ja: この調整をすることによって、この関数はユーザ視点からの一貫した「マウス検出」挙動を保証します。

source: By using a bundle object, you can access a bundle's resources without knowing the structure of the bundle.
ja: バンドルオブジェクトを使うことによって、あなたはバンドルの持つリソースにアクセスすることが、バンドルの構造を知ることなしに可能です。

source: Bytes are swapped from each low-order position to the corresponding high-order position and vice versa.
ja: バイトは、各下位位置から対応する上位位置へ、そして逆に、スワップされます。

source: Cache Behavior
ja: キャッシュ挙動

source: Cached responses also contain a user info dictionary where you can store app-specific information about the cached item.
ja: キャッシュされた応答はまた、ユーザ情報辞書を含みます、そこにあなたはキャッシュされた項目についてのアプリ特有の情報を格納できます。

source: Calculates the intersection of two rectangles.
ja: ２つの矩形の交差を計算する。

source: Calculates the union of two rectangles.
ja: ２つの矩形の併合を計算する。

source: Calculating Dates from Components
ja: 構成要素から日付を計算する

source: Calculating Intervals
ja: 隔たりを計算する

source: Calculation error constants used to describe an error in exception During Operation(_: error: left Operand: right Operand:).
ja: exception During Operation(_: error: left Operand: right Operand:)におけるエラーを解説するのに使われる計算エラー定数。

source: Calendrical Calculations
ja: カレンダーに関する計算

source: Calendrical calculations with unspecified year or year value prior to the start of a calendar are not advised.
ja: 指定されないyearまたはそのカレンダーの始まりより前のyear値を持つカレンダー関連計算は、勧められません。

source: Call resume() on the connection.
ja: resume()をこの接続上で呼び出してください。

source: Call the Block once after the completion of any matching.
ja: 何らかのマッチングの完成の後、「ブロック」を一度呼びます。

source: Call the Block periodically during long-running match operations.
ja: 長く行われているマッチ操作の間、定期的に「ブロック」を呼びます。

source: Call the custom action methods on the proxy object.
ja: あつらえのアクションメソッドをプロキシオブジェクト上で呼び出してください。

source: Calling swap At(_: _:) with the same index as both i and j has no effect.
ja: swap At(_: _:)をiとj両方で同じインデックスで呼び出すことは、効果を持ちません。

source: Calling the remove Subrange(_:) method instead is preferred.
ja: remove Subrange(_:)メソッドを代わりに呼ぶことが好まれます。

source: Calling the insert(contents Of: at:) method instead is preferred.
ja: insert(contents Of: at:)メソッドを代わりに呼ぶことが好まれます。

source: Calling the related sorted() method is equivalent to calling this method and passing the less-than operator (<) as the predicate.
ja: 関連したsorted()メソッドを呼び出すことは、このメソッドを呼び出して、より小さい演算子（<）を述部として渡すことと等しいです。

source: Calling this method also notifies your file presenter of the new location of the file so that your app can continue to operate on it.
ja: このメソッドを呼び出すことはまた、ファイルの新しい場所のあなたのファイルプレゼンタに通知します、それであなたのアプリはそれに関する操作を続けられます。

source: Calling this method is equivalent to, but not necessarily implemented as, setting the date Format property to the result of calling the date Format(from Template: options: locale:) method, passing no options and the locale property value.
ja: このメソッドを呼ぶことは、date Formatプロパティを、date Format(from Template: options: locale:)メソッドを、オプション無しでlocaleプロパティ値を渡して呼び出す結果に設定するのに等しいです、しかし必ずしもそのように実装されません。

source: Calling this method may invalidate all saved indices of this collection.
ja: このメソッドを呼び出すことは、このコレクションの全ての保存されたインデックスを無効にします。

source: Calling this method may invalidate any existing indices for use with this collection.
ja: このメソッドを呼び出すことは、このコレクションで使うためのあらゆる既存のインデックスを無効にします。

source: Calling this method while the receiver is executing or has already finished causes an NSInvalid Argument Exception exception to be thrown.
ja: レシーバが実行しているまたは既に終了している時にこのメソッドを呼び出すことは、NSInvalid Argument Exception例外がスローされるようにします。

source: Calls the given closure on each element in the sequence in the same order as a for-in loop.
ja: 指定されたクロージャをそのシーケンスの各要素上でfor-inループと同じ順番で呼び出します。

source: Can be nil.
ja: nilであることが可能です。

source: Can be either a simple hostname, such as "sales", or a fully qualified domain name, such as "sales .anycorp .com".
ja: 単純なホスト名、例えば"sales"など、または完全修飾ドメイン名、例えば"sales .anycorp .com"などのどちらでも可能です。

source: Can be raised by key-value coding methods that want to explicitly disallow certain manipulations or accesses.
ja: 明示的に特定の操作またはアクセスを許可しないようにしたいキー値コーディングメソッドによって引き起こされることができます。

source: Can be used to resume handling of the Apple event.
ja: アップルイベントの処理をレジューム（再開）するのに使われることができます。

source: Can use any unit in the formatter content.
ja: フォーマッタ内容において何らかの単位を使うことができます。

source: Cancels perform requests previously registered with perform(_: with: after Delay:).
ja: perform(_: with: after Delay:)で登録された実行要請を取消します。

source: Cancels perform requests previously registered with the perform(_: with: after Delay:) instance method.
ja: 以前にperform(_: with: after Delay:)インスタンスメソッドで登録された実行要請を取消します。

source: Capitalize each word that follows an underscore.
ja: アンダースコアに続く各単語を頭文字化します。

source: Capturing parentheses.
ja: 捕獲する括弧。

source: Case transformations aren’t guaranteed to be symmetrical or to produce strings of the same lengths as the originals.
ja: 大文字小文字変換は、対称的であることを、または元と同じ長さの文字列を生み出すことを保証されません。

source: Casts an Objective-C pointer to a Core Foundation pointer and also transfers ownership to the caller.
ja: Objective-CポインタをCore Foundationポインタにキャストします、そしてまた所有権を呼び出し側に移します。

source: Causes 1000 bytes to be shown as 1 KB.
ja: 1000バイトを1 KBと表示されるようにします。

source: Causes 1024 bytes to be shown as 1 KB.
ja: 1024バイトを1 KBと表示されるようにします。

source: Causes replace Item(at: with Item At: backup Item Name: options: resulting Item URL:) to leave the backup item in place after a successful replacement.
ja: replace Item(at: with Item At: backup Item Name: options: resulting Item URL:)にバックアップ項目をその場に、うまくいった置き換えの後で、残しておくようにさせます。

source: Causes replace Item(at: with Item At: backup Item Name: options: resulting Item URL:) to use metadata from the new item only and not to attempt to preserve metadata from the original item.
ja: replace Item(at: with Item At: backup Item Name: options: resulting Item URL:)が新しい項目からのみメタデータを使うようにし、元の項目からメタデータを保存しようと企てないようにします。

source: Causes all in-memory data and attributes of the file represented by the receiver to be written to permanent storage.
ja: レシーバによって表されるファイルの全てのインメモリデータと属性が、永久ストレージに書き出されるようにします。

source: Causes the Apple event specified by the Apple Event to be dispatched to the appropriate Apple event handler, if one has been registered by calling set Event Handler(_: and Selector: for Event Class: and Event ID:).
ja: そういったものがthe Apple Eventで指定されるアップルイベントが適切なアップルイベントハンドラーに発送されるようにします、もしset Event Handler(_: and Selector: for Event Class: and Event ID:)を呼び出すことで登録されているならば。

source: Causes the receiver to skip recursion into the most recently obtained subdirectory.
ja: 最も新しく取得された下位ディレクトリへの再帰をレシーバにスキップさせます。

source: Caution should be taken when obtaining the version from within an NSCoding protocol or other methods.
ja: NSCodingプロトコルまたは他のメソッド内部からバージョンを手に入れる時は注意が払われるべきです。

source: Change Key Names
ja: キー名を変更する

source: Change Notification
ja: 通知を変更する

source: Change the flag settings.
ja: フラグ設定を変更します。

source: Changes apply to the portion of the pattern following the setting.
ja: 変更は、設定に続いているパターンの部分に適用されます。

source: Changes made to the cookie accept policy affect all currently running applications using the cookie storage.
ja: クッキー受入方針にされる変更は、クッキーストレージを使っている全ての現在動作中のアプリケーションに影響します。

source: Changes the attributes of a given file or directory.
ja: 与えられたファイルまたはディレクトリの属性を変更します。

source: Changes the path of the current working directory to the specified path.
ja: 現在の作業ディレクトリのパスを指定されたパスに変更します。

source: Changes the size of the block of memory pointed to by ptr to size bytes.
ja: ポイントをつけられるメモリブロックのサイズをptr to sizeバイトによって変更します。

source: Changes the top-level error handler.
ja: トップレベルのエラーハンドラを変更します。

source: Changes to an item in one location are propagated to all other locations to ensure the items stay in sync.
ja: ある場所でアイテムに加えられる変更は、全ての他の場所に伝えられて、アイテムが同期されたままであるのを保証します。

source: Changing Case
ja: 大文字小文字の変更

source: Changing a component’s value often will require higher or coupled components to change as well.
ja: ある構成要素の値を変えることは、しばしばより高位のまたは結びつけて考えられる構成要素もまた変更する必要があります。

source: Changing how NSArray stores the elements of its collection.
ja: NSArrayがそれのコレクションの要素を格納する方法を変える。

source: Changing the cookie policy affects all currently running applications using the cookie storage.
ja: クッキー方針の変更は、クッキーストレージを使っている全ての現在動作中のアプリケーションに影響します。

source: Character
ja: 文字

source: Character Expression
ja: 文字表現

source: Character special file
ja: Character特殊ファイル

source: Characters
ja: さまざまな文字

source: Characters that must be quoted to be treated as literals are * ? + [ ( ) { } ^ $ | \ . /
ja: リテラルとして扱われるために引用されなければならない文字は、* ? + [ ( ) { } ^ $ | \ . /です。

source: Children (recursive).
ja: 子ら（再帰的）。

source: Choose Properties to Encode and Decode Using Coding Keys
ja: プロパティを選択してエンコードとデコードをコーディングキーを使って行う

source: Classes
ja: クラス

source: Classes (and categories) are loaded from just one file within the bundle directory.
ja: さまざまなクラス（そしてカテゴリ）は、バンドルディレクトリ内部のただ１つのファイルからロードされます。

source: Classes (and categories) are loaded from just one file within the bundle directory; this code file has the same name as the directory, but without the extension (“.bundle”, “.app”, “.framework”).
ja: クラス（そしてカテゴリ）は、バンドルディレクトリ内のただ１つのファイルからロードされます；このコードファイルはディレクトリと同じ名前を持ちます、しかし拡張子（".bundle”、“.app”、“.framework”）なしで。

source: Classic Macintosh Roman encoding.
ja: クラシック Macintosh Roman エンコーディング。

source: Cocoa also includes appropriate compare: method implementations for the NSDate, NSDecimal Number, and NSValue classes.
ja: Cocoaはまた、適切なcompare:メソッド実装をNSDate、NSDecimal Number、そしてNSValueクラスのために含みます。

source: Cocoa doesn’t currently provide a mechanism for applications to directly send raw Apple events (though compiling and executing an AppleScript script with NSApple Script may result in Apple events being sent).
ja: Cocoaは、直接に生のアップルイベントを送る仕組みをアプリケーションに対して現在は提供しません（もっともAppleScriptスクリプトをNSApple Scriptでコンパイルして実行するのはアップルイベントが送られる結果となります）。

source: Cocoa provides built-in scriptability support that uses scriptability information supplied by an application to automatically convert Apple events into script command objects that perform the desired operation.
ja: Cocoaは、組み込みのスクリプト対応機能をサポートします、それは、あるアプリケーションによって提供されるスクリプト対応機能情報を使って、自動的に様々なアップルイベントを色々な望む操作を実行するスクリプトコマンドオブジェクトへと変換します。

source: Cocoa provides default implementations of these scripting comparison methods for NSString and NSAttributed String.
ja: Cocoaは、これらスクリプティング比較メソッドの省略時実装をNSStringとNSAttributed Stringに対して提供します。

source: Cocoa scripting takes advantage of key-value coding to get and set information in scriptable objects.
ja: Cocoaスクリプティングは、「キー値」コーディングを利用して、スクリプト対応オブジェクトの中の情報を取得および設定します。

source: Cocoa scripting uses these scripting comparison methods, if available, in the process of evaluating specifier tests.
ja: Cocoaスクリプティングはそれらスクリプティング比較メソッドを、利用可能ならば、指定子テストを評価する過程において使います。

source: Codable types can declare a special nested enumeration named Coding Keys that conforms to the Coding Key protocol.
ja: コード化可能型は、Coding Keysと名前を付けられ、Coding Keyプロトコルに準拠する、ある特殊な入れ子列挙を宣言できます。

source: Coercion
ja: 強制

source: Coercions frequently are required during key-value coding.
ja: 強制はしばしば、キー値コーディングの間を通して要求されます。

source: Collections
ja: さまざまなコレクション

source: Combine or separate data from different depths of a JSON structure by writing custom implementations of protocol requirements from Encodable and Decodable.
ja: JSON構造体の異なる深さからデータを結合または分離を、EncodableとDecodableからのプロトコル要件のあつらえの実装を書くことで行ってください。

source: Combine the words into a single string.
ja: 単語を単一の文字列へと結合します。

source: Combines the elements of two index paths into a single index path.
ja: ２つのインデックスパスの要素を単一のインデックスパスに結合します。

source: Combining Character Sets
ja: 文字集合を結合する

source: Combining Index Sets
ja: インデックス集合を結合する

source: Commonly Used Methods
ja: 頻繁に使われるメソッド

source: Communicating Asynchronously
ja: 非同期通信

source: Compacts the decimal structure for efficiency.
ja: 効率のために10進構造体をコンパクトにします。

source: Compare dates and times, and perform calendar and time zone calculations.
ja: 日付や時刻を比較します、そしてカレンダーやタイムゾーンの計算を実行します。

source: Compares strings as sorted by the Finder.
ja: 文字列をFinderでソートされるように比較します。

source: Compares the elements of two map tables for equality.
ja: ２つのマップテーブルの要素を同等性について比較する。

source: Compares the receiving array to another array.
ja: 受け手側の配列を別の配列と比較します。

source: Compares the string and a given string using a localized comparison.
ja: ローカライズされた比較を使って、文字列を与えられた文字列と比較します。

source: Compares the string using the specified options and returns the lexical ordering for the range.
ja: 文字列を指定されたオプションを使って比較して、範囲の語彙的順序を返します。

source: Compares this index path to another in depth-first traversal order.
ja: このインデックスパスを別ものもと深さ優先横断順で比較します。

source: Compares two date values.
ja: ２つの日付値を比較します。

source: Compares two dates down to the specified component.
ja: 指定された構成要素へと至るまで２つの日付を比較します。

source: Compares two decimal values.
ja: ２つの10進数値を比較します。

source: Compares two intervals.
ja: ２つの間隔を比較します。

source: Comparing Arrays
ja: 配列を比較する

source: Comparing Calendars
ja: カレンダーを比較する
